dany994/vak-opensource/trunk/microcontrollers/pic32prog/adapter-pickit2.c
/*
 * Интерфейс через адаптер FT2232 к процессору Элвис Мультикор.
 * Автор: С.Вакуленко.
 *
 * Этот файл распространяется в надежде, что он окажется полезным, но
 * БЕЗ КАКИХ БЫ ТО НИ БЫЛО ГАРАНТИЙНЫХ ОБЯЗАТЕЛЬСТВ; в том числе без косвенных
 * гарантийных обязательств, связанных с ПОТРЕБИТЕЛЬСКИМИ СВОЙСТВАМИ и
 * ПРИГОДНОСТЬЮ ДЛЯ ОПРЕДЕЛЕННЫХ ЦЕЛЕЙ.
 *
 * Вы вправе распространять и/или изменять этот файл в соответствии
 * с условиями Генеральной Общественной Лицензии GNU (GPL) в том виде,
 * как она была опубликована Фондом Свободного ПО; либо версии 2 Лицензии
 * либо (по вашему желанию) любой более поздней версии. Подробности
 * смотрите в прилагаемом файле 'COPYING.txt'.
 */
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <fcntl.h>
#include <string.h>
#include <errno.h>
#include <usb.h>

#include "adapter.h"
#include "pickit2.h"
#include "executive.h"
#include "pic32.h"

typedef struct {
    /* Общая часть */
    adapter_t adapter;

    /* Доступ к устройству через libusb. */
    usb_dev_handle *usbdev;

    unsigned char reply [64];
    unsigned use_executable;
    unsigned serial_execution_mode;

} pickit2_adapter_t;

/*
 * Identifiers of USB adapter.
 */
#define MICROCHIP_VID           0x04d8
#define PICKIT2_PID             0x0033  /* Microchip PICkit 2 */

/*
 * USB endpoints.
 */
#define OUT_EP                  0x01
#define IN_EP                   0x81

#define IFACE                   0
#define TIMO_MSEC               1000

static void pickit2_send_buf (pickit2_adapter_t *a, unsigned char *buf, unsigned nbytes)
{
    if (debug_level > 0) {
        int k;
        fprintf (stderr, "---Send");
        for (k=0; k<nbytes; ++k) {
            if (k != 0 && (k & 15) == 0)
                fprintf (stderr, "\n       ");
            fprintf (stderr, " %02x", buf[k]);
        }
        fprintf (stderr, "\n");
    }
    if (usb_interrupt_write (a->usbdev, OUT_EP, (char*) buf, 64, TIMO_MSEC) < 0) {
        fprintf (stderr, "PICkit2: error sending packet\n");
        usb_release_interface (a->usbdev, IFACE);
        usb_close (a->usbdev);
        exit (-1);
    }
}

static void pickit2_send (pickit2_adapter_t *a, unsigned argc, ...)
{
    va_list ap;
    unsigned i;
    unsigned char buf [64];

    memset (buf, CMD_END_OF_BUFFER, 64);
    va_start (ap, argc);
    for (i=0; i<argc; ++i)
        buf[i] = va_arg (ap, int);
    va_end (ap);
    pickit2_send_buf (a, buf, i);
}

static void pickit2_recv (pickit2_adapter_t *a)
{
    if (usb_interrupt_read (a->usbdev, IN_EP, (char*) a->reply,
            64, TIMO_MSEC) != 64) {
        fprintf (stderr, "PICkit2: error receiving packet\n");
        usb_release_interface (a->usbdev, IFACE);
        usb_close (a->usbdev);
        exit (-1);
    }
    if (debug_level > 0) {
        int k;
        fprintf (stderr, "--->>>>");
        for (k=0; k<64; ++k) {
            if (k != 0 && (k & 15) == 0)
                fprintf (stderr, "\n       ");
            fprintf (stderr, " %02x", a->reply[k]);
        }
        fprintf (stderr, "\n");
    }
}

static void check_timeout (pickit2_adapter_t *a, const char *message)
{
    unsigned status;

    pickit2_send (a, 2, CMD_READ_STATUS);
    pickit2_recv (a);
    status = a->reply[0] | a->reply[1] << 8;
    if (status & STATUS_ICD_TIMEOUT) {
        fprintf (stderr, "PICkit2: timed out at %s, status = %04x\n",
            message, status);
        exit (-1);
    }
}

/*
 * Put device to serial execution mode.
 */
static void serial_execution (pickit2_adapter_t *a)
{
    if (a->serial_execution_mode)
        return;
    a->serial_execution_mode = 1;

    // Enter serial execution.
    if (debug_level > 0)
        fprintf (stderr, "PICkit2: enter serial execution\n");
    pickit2_send (a, 29, CMD_EXECUTE_SCRIPT, 27,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_STATUS,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_ASSERT_RST,
        SCRIPT_JT2_SENDCMD, TAP_SW_ETAP,
        SCRIPT_JT2_SETMODE, 6, 0x1F,
        SCRIPT_JT2_SENDCMD, ETAP_EJTAGBOOT,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_DEASSERT_RST,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_FLASH_ENABLE);
}

/*
 * Download programming executable (PE).
 */
static void pickit2_load_executable (adapter_t *adapter)
{
    pickit2_adapter_t *a = (pickit2_adapter_t*) adapter;

//fprintf (stderr, "PICkit2: load_executable\n");
    a->use_executable = 1;
    serial_execution (a);

#define INSTRUCTION(w)  (unsigned char) (w), \
                        (unsigned char) ((w) >> 8), \
                        (unsigned char) ((w) >> 16), \
                        (unsigned char) ((w) >> 24)

fprintf (stderr, "PICkit2: download PE loader\n");
    pickit2_send (a, 45, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 28,
            INSTRUCTION (0x3c04bf88),           // step 1
            INSTRUCTION (0x34842000),
            INSTRUCTION (0x3c05001f),
            INSTRUCTION (0x34a50040),
            INSTRUCTION (0xac850000),
            INSTRUCTION (0x34050800),           // step 2
            INSTRUCTION (0xac850010),
        CMD_EXECUTE_SCRIPT, 12,                 // execute
            SCRIPT_JT2_SENDCMD, TAP_SW_ETAP,
            SCRIPT_JT2_SETMODE, 6, 0x1F,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF);
    check_timeout (a, "1");                     // Any timeouts?

    pickit2_send (a, 30, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 20,
            INSTRUCTION (0x34058000),           // step 3
            INSTRUCTION (0xac850020),
            INSTRUCTION (0xac850030),
            INSTRUCTION (0x3c04a000),           // step 4
            INSTRUCTION (0x34840800),
        CMD_EXECUTE_SCRIPT, 5,                  // execute
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF);
    check_timeout (a, "2");                      // Any timeouts?

    // Download the PE loader
    int i;
    for (i=0; i<PIC32_PE_LOADER_LEN; i+=2) {
        pickit2_send (a, 25, CMD_CLEAR_DOWNLOAD_BUFFER,
            CMD_DOWNLOAD_DATA, 16,
                INSTRUCTION ((0x3c060000 | pic32_pe_loader[i])),    // step 5
                INSTRUCTION ((0x34c60000 | pic32_pe_loader[i+1])),
                INSTRUCTION (0xac860000),
                INSTRUCTION (0x24840004),
            CMD_EXECUTE_SCRIPT, 4,              // execute
                SCRIPT_JT2_XFERINST_BUF,
                SCRIPT_JT2_XFERINST_BUF,
                SCRIPT_JT2_XFERINST_BUF,
                SCRIPT_JT2_XFERINST_BUF);
        check_timeout (a, "3");                 // Any timeouts?
    }

    // Jump to PE loader
    pickit2_send (a, 42, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 16,
            INSTRUCTION (0x3c19a000),           // step 6
            INSTRUCTION (0x37390800),
            INSTRUCTION (0x03200008),
            INSTRUCTION (0x00000000),
        CMD_EXECUTE_SCRIPT, 21,                 // execute
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_SENDCMD, TAP_SW_ETAP,
            SCRIPT_JT2_SETMODE, 6, 0x1F,
            SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
            SCRIPT_JT2_XFRFASTDAT_LIT,
                0, 9, 0, 0xA0,                  // PE_ADDRESS = 0xA000_0900
            SCRIPT_JT2_XFRFASTDAT_LIT,
                (unsigned char) PIC32_PE_LEN,   // PE_SIZE
                (unsigned char) (PIC32_PE_LEN >> 8),
                0, 0);
    check_timeout (a, "4");                     // Any timeouts?

    // Download the PE itself (step 7-B)
fprintf (stderr, "PICkit2: download PE\n");
    int nloops = (PIC32_PE_LEN + 9) / 10;
    for (i=0; i<nloops; i++) {                  // download 10 at a time
        int j = i * 10;
        pickit2_send (a, 55, CMD_CLEAR_DOWNLOAD_BUFFER,
            CMD_DOWNLOAD_DATA, 40,
                INSTRUCTION (pic32_pe[j]),
                INSTRUCTION (pic32_pe[j+1]),
                INSTRUCTION (pic32_pe[j+2]),
                INSTRUCTION (pic32_pe[j+3]),
                INSTRUCTION (pic32_pe[j+4]),
                INSTRUCTION (pic32_pe[j+5]),
                INSTRUCTION (pic32_pe[j+6]),
                INSTRUCTION (pic32_pe[j+7]),
                INSTRUCTION (pic32_pe[j+8]),
                INSTRUCTION (pic32_pe[j+9]),
            CMD_EXECUTE_SCRIPT, 10,             // execute
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF,
                SCRIPT_JT2_XFRFASTDAT_BUF);
        check_timeout (a, "5");                 // Any timeouts?
    }
    mdelay (100);

