dany994/vak-opensource/trunk/microcontrollers/pic32prog/adapter-pickit2.c
    // Download the PE instructions
    pickit2_send (a, 15, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 8,
            INSTRUCTION (0x00000000),           // step 8 - jump to PE
            INSTRUCTION (0xDEAD0000),
        CMD_EXECUTE_SCRIPT, 2,                  // execute
            SCRIPT_JT2_XFRFASTDAT_BUF,
            SCRIPT_JT2_XFRFASTDAT_BUF);
    check_timeout (a, "6");                     // Any timeouts?
    mdelay (100);

    pickit2_send (a, 11, CMD_CLEAR_UPLOAD_BUFFER,
        CMD_EXECUTE_SCRIPT, 8,
            SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
            SCRIPT_JT2_XFRFASTDAT_LIT,
                0x00, 0x00,                     // length = 0
                0x07, 0x00,                     // EXEC_VERSION
            SCRIPT_JT2_GET_PE_RESP);
    check_timeout (a, "7");                     // Any timeouts?
    pickit2_send (a, 1, CMD_UPLOAD_DATA);
    pickit2_recv (a);

    unsigned version = a->reply[3] | (a->reply[4] << 8);
    if (version != 0x0007) {                    // command echo
        fprintf (stderr, "PICkit2: bad PE reply = %04x\n", version);
        exit (-1);
    }
    version = a->reply[1] | (a->reply[2] << 8);
    if (version != PIC32_PE_VERSION) {
        fprintf (stderr, "PICkit2: bad PE version = %04x, expected %04x\n",
            version, PIC32_PE_VERSION);
        exit (-1);
    }
fprintf (stderr, "PICkit2: PE version = %04x\n", version);
}

#if 0
int pe_blank_check (pickit2_adapter_t *a,
    unsigned int start, unsigned int nbytes)
{
    pickit2_send (a, 21, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 18,
        SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
        SCRIPT_JT2_XFRFASTDAT_LIT,
            0x00, 0x00,
            0x06, 0x00,                         // BLANK_CHECK
        SCRIPT_JT2_XFRFASTDAT_LIT,
            (unsigned char) start,
            (unsigned char) (start >> 8),
            (unsigned char) (start >> 16),
            (unsigned char) (start >> 24),
        SCRIPT_JT2_XFRFASTDAT_LIT,
            (unsigned char) nbytes,
            (unsigned char) (nbytes >> 8),
            (unsigned char) (nbytes >> 16),
            (unsigned char) (nbytes >> 24),
        SCRIPT_JT2_GET_PE_RESP);
    check_timeout (a, "8");                     // Any timeouts?
    pickit2_send (a, 1, CMD_UPLOAD_DATA);
    pickit2_recv (a);
    if (a->reply[3] != 6 || a->reply[1] != 0) { // response code 0 = success
        return 0;
    }
    return 1;
}

int pe_get_crc (pickit2_adapter_t *a,
    unsigned int start, unsigned int nbytes)
{
    pickit2_send (a, 22, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 19,
        SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
        SCRIPT_JT2_XFRFASTDAT_LIT,
            0x00, 0x00,
            0x08, 0x00,                         // GET_CRC
        SCRIPT_JT2_XFRFASTDAT_LIT,
            (unsigned char) start,
            (unsigned char) (start >> 8),
            (unsigned char) (start >> 16),
            (unsigned char) (start >> 24),
        SCRIPT_JT2_XFRFASTDAT_LIT,
            (unsigned char) nbytes,
            (unsigned char) (nbytes >> 8),
            (unsigned char) (nbytes >> 16),
            (unsigned char) (nbytes >> 24),
        SCRIPT_JT2_GET_PE_RESP,
        SCRIPT_JT2_GET_PE_RESP);
    check_timeout (a, "9");                     // Any timeouts?
    pickit2_send (a, 1, CMD_UPLOAD_DATA);
    pickit2_recv (a);
    if (a->reply[3] != 8 || a->reply[1] != 0) { // response code 0 = success
        return 0;
    }

    int crc = a->reply[5] | (a->reply[6] << 8);
    return crc;
}
#endif

static void pickit2_close (adapter_t *adapter)
{
    pickit2_adapter_t *a = (pickit2_adapter_t*) adapter;
//fprintf (stderr, "PICkit2: close\n");

    /* Exit programming mode. */
    pickit2_send (a, 18, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 15,
        SCRIPT_JT2_SETMODE, 5, 0x1f,
        SCRIPT_VPP_OFF,
        SCRIPT_MCLR_GND_ON,
        SCRIPT_VPP_PWM_OFF,
        SCRIPT_SET_ICSP_PINS, 6,
        SCRIPT_SET_ICSP_PINS, 2,
        SCRIPT_SET_ICSP_PINS, 3,
        SCRIPT_DELAY_LONG, 10,                  // 50 msec
        SCRIPT_BUSY_LED_OFF);

    /* Detach power from the board. */
    pickit2_send (a, 4, CMD_EXECUTE_SCRIPT, 2,
        SCRIPT_VDD_OFF,
        SCRIPT_VDD_GND_ON);

    /* Disable reset. */
    pickit2_send (a, 3, CMD_EXECUTE_SCRIPT, 1,
        SCRIPT_MCLR_GND_OFF);

    /* Read board status. */
    pickit2_send (a, 2, CMD_CLEAR_UPLOAD_BUFFER, CMD_READ_STATUS);
    pickit2_recv (a);
//fprintf (stderr, "PICkit2: status %02x%02x\n", a->reply[1], a->reply[0]);

    usb_release_interface (a->usbdev, IFACE);
    usb_close (a->usbdev);
    free (a);
}

/*
 * Read the Device Identification code
 */
static unsigned pickit2_get_idcode (adapter_t *adapter)
{
    pickit2_adapter_t *a = (pickit2_adapter_t*) adapter;
    unsigned idcode;

    /* Read device id. */
    pickit2_send (a, 12, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 9,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_IDCODE,
        SCRIPT_JT2_XFERDATA32_LIT, 0, 0, 0, 0);
    pickit2_send (a, 1, CMD_UPLOAD_DATA);
    pickit2_recv (a);
//fprintf (stderr, "PICkit2: read id, %d bytes: %02x %02x %02x %02x\n", a->reply[0], a->reply[1], a->reply[2], a->reply[3], a->reply[4]);
    if (a->reply[0] != 4)
        return 0;
    idcode = a->reply[1] | a->reply[2] << 8 | a->reply[3] << 16 | a->reply[4] << 24;
    return idcode;
}

/*
 * Read a word from memory (without PE).
 */
static unsigned pickit2_read_word (adapter_t *adapter, unsigned addr)
{
    pickit2_adapter_t *a = (pickit2_adapter_t*) adapter;
    serial_execution (a);

    unsigned addr_lo = addr & 0xFFFF;
    unsigned addr_hi = (addr >> 16) & 0xFFFF;
    pickit2_send (a, 64, CMD_CLEAR_DOWNLOAD_BUFFER,
        CMD_CLEAR_UPLOAD_BUFFER,
        CMD_DOWNLOAD_DATA, 28,
            INSTRUCTION (0x3c04bf80),               // lui s3, 0xFF20
            INSTRUCTION (0x3c080000 | addr_hi),     // lui t0, addr_hi
            INSTRUCTION (0x35080000 | addr_lo),     // ori t0, addr_lo
            INSTRUCTION (0x8d090000),               // lw t1, 0(t0)
            INSTRUCTION (0xae690000),               // sw t1, 0(s3)
            INSTRUCTION (0x00094842),               // srl t1, 1
            INSTRUCTION (0xae690004),               // sw t1, 4(s3)
        CMD_EXECUTE_SCRIPT, 29,
            SCRIPT_JT2_SENDCMD, TAP_SW_ETAP,
            SCRIPT_JT2_SETMODE, 6, 0x1F,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,      // read FastData
            SCRIPT_JT2_XFERDATA32_LIT, 0, 0, 0, 0,
            SCRIPT_JT2_SETMODE, 6, 0x1F,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_XFERINST_BUF,
            SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,      // read FastData
            SCRIPT_JT2_XFERDATA32_LIT, 0, 0, 0, 0,
        CMD_UPLOAD_DATA);
    pickit2_recv (a);
    if (a->reply[0] != 8) {
        fprintf (stderr, "PICkit2: read word %08x: bad reply length=%u\n",
            addr, a->reply[0]);
        exit (-1);
    }
    unsigned value = a->reply[1] | (a->reply[2] << 8) |
           (a->reply[3] << 16) | (a->reply[4] << 24);
    unsigned value2 = a->reply[5] | (a->reply[6] << 8) |
           (a->reply[7] << 16) | (a->reply[8] << 24);
//fprintf (stderr, "    %08x -> %08x %08x\n", addr, value, value2);
    value >>= 1;
    value |= value2 & 0x80000000;
    return value;
}

