dany994/vak-opensource/trunk/microcontrollers/pic32prog/adapter-pickit2.c
/*
 * Чтение блока памяти размером, кратным 1 килобайту.
 */
static void pickit2_read_data (adapter_t *adapter,
    unsigned addr, unsigned nwords, unsigned *data)
{
    pickit2_adapter_t *a = (pickit2_adapter_t*) adapter;
    unsigned char buf [64];
    unsigned words_read;

//fprintf (stderr, "PICkit2: read %d bytes from %08x\n", nwords*4, addr);
    if (! a->use_executable) {
        /* Without PE. */
        for (; nwords > 0; nwords--) {
            *data++ = pickit2_read_word (adapter, addr);
            addr += 4;
        }
        return;
    }

    /* Use PE to read memory. */
    for (words_read = 0; words_read < nwords; ) {
        /* Download addresses for 8 script runs. */
        unsigned i, k = 0;
        memset (buf, CMD_END_OF_BUFFER, 64);
        buf[k++] = CMD_CLEAR_DOWNLOAD_BUFFER;
        buf[k++] = CMD_DOWNLOAD_DATA;
        buf[k++] = 8 * 4;
        for (i = 0; i < 8; i++) {
            unsigned address = addr + words_read*4 + i*32*4;
            buf[k++] = address;
            buf[k++] = address >> 8;
            buf[k++] = address >> 16;
            buf[k++] = address >> 24;
        }
        pickit2_send_buf (a, buf, k);

        for (k = 0; k < 8; k++) {
            /* Read progmem. */
            pickit2_send (a, 17, CMD_CLEAR_UPLOAD_BUFFER,
                CMD_EXECUTE_SCRIPT, 13,
                    SCRIPT_JT2_SENDCMD, ETAP_FASTDATA,
                    SCRIPT_JT2_XFRFASTDAT_LIT, 0x20, 0, 1, 0,
                    SCRIPT_JT2_XFRFASTDAT_BUF,
                    SCRIPT_JT2_WAIT_PE_RESP,
                    SCRIPT_JT2_GET_PE_RESP,
                    SCRIPT_LOOP, 1, 31,
                CMD_UPLOAD_DATA_NOLEN);
            pickit2_recv (a);
            memcpy (data, a->reply, 64);
            data += 64/4;
            words_read += 64/4;

            /* Get second half of upload buffer. */
            pickit2_send (a, 1, CMD_UPLOAD_DATA_NOLEN);
            pickit2_recv (a);
            memcpy (data, a->reply, 64);
            data += 64/4;
            words_read += 64/4;
        }
    }
}

/*
 * Erase all flash memory.
 */
static void pickit2_erase_chip (adapter_t *adapter)
{
    pickit2_adapter_t *a = (pickit2_adapter_t*) adapter;

    //fprintf (stderr, "PICkit2: erase chip\n");
    pickit2_send (a, 11, CMD_CLEAR_UPLOAD_BUFFER, CMD_EXECUTE_SCRIPT, 8,
        SCRIPT_JT2_SENDCMD, TAP_SW_MTAP,
        SCRIPT_JT2_SENDCMD, MTAP_COMMAND,
        SCRIPT_JT2_XFERDATA8_LIT, MCHP_ERASE,
        SCRIPT_DELAY_LONG, 74);                 // 400 msec
    check_timeout (a, "7");                     // Any timeouts?
}

/*
 * Инициализация адаптера F2232.
 * Возвращаем указатель на структуру данных, выделяемую динамически.
 * Если адаптер не обнаружен, возвращаем 0.
 */
adapter_t *adapter_open_pickit2 (void)
{
    pickit2_adapter_t *a;
    struct usb_bus *bus;
    struct usb_device *dev;

    usb_init();
    usb_find_busses();
    usb_find_devices();
    for (bus = usb_get_busses(); bus; bus = bus->next) {
        for (dev = bus->devices; dev; dev = dev->next) {
            if (dev->descriptor.idVendor == MICROCHIP_VID &&
                (dev->descriptor.idProduct == PICKIT2_PID))
                goto found;
        }
    }
    /*fprintf (stderr, "USB adapter not found: vid=%04x, pid=%04x\n",
        MICROCHIP_VID, PICKIT2_PID);*/
    return 0;
found:
    /*fprintf (stderr, "found USB adapter: vid %04x, pid %04x, type %03x\n",
        dev->descriptor.idVendor, dev->descriptor.idProduct,
        dev->descriptor.bcdDevice);*/
    a = calloc (1, sizeof (*a));
    if (! a) {
        fprintf (stderr, "Out of memory\n");
        return 0;
    }
    a->usbdev = usb_open (dev);
    if (! a->usbdev) {
        fprintf (stderr, "PICkit2: usb_open() failed\n");
        free (a);
        return 0;
    }
    if (usb_set_configuration (a->usbdev, 2) < 0) {
        fprintf (stderr, "PICkit2: cannot set USB configuration\n");
failed: usb_release_interface (a->usbdev, IFACE);
        usb_close (a->usbdev);
        free (a);
        return 0;
    }
    if (usb_claim_interface (a->usbdev, IFACE) < 0) {
        fprintf (stderr, "PICkit2: cannot claim USB interface\n");
        goto failed;
    }

    /* Read version of adapter. */
    pickit2_send (a, 2, CMD_CLEAR_UPLOAD_BUFFER, CMD_GET_VERSION);
    pickit2_recv (a);
    printf ("PICkit2: Version %d.%d.%d\n",
        a->reply[0], a->reply[1], a->reply[2]);

    /* Detach power from the board. */
    pickit2_send (a, 4, CMD_EXECUTE_SCRIPT, 2,
        SCRIPT_VDD_OFF,
        SCRIPT_VDD_GND_ON);

    /* Setup power voltage 3.3V, fault limit 2.81V. */
    unsigned vdd = (unsigned) (3.3 * 32 + 10.5) << 6;
    unsigned vdd_limit = (unsigned) ((2.81 / 5) * 255);
    pickit2_send (a, 4, CMD_SET_VDD, vdd, vdd >> 8, vdd_limit);

    /* Setup reset voltage 3.28V, fault limit 2.26V. */
    unsigned vpp = (unsigned) (3.28 * 18.61);
    unsigned vpp_limit = (unsigned) (2.26 * 18.61);
    pickit2_send (a, 4, CMD_SET_VPP, 0x40, vpp, vpp_limit);

    /* Setup serial speed. */
    unsigned divisor = 10;
    pickit2_send (a, 4, CMD_EXECUTE_SCRIPT, 2,
        SCRIPT_SET_ICSP_SPEED, divisor);

    /* Reset active low. */
    pickit2_send (a, 3, CMD_EXECUTE_SCRIPT, 1,
        SCRIPT_MCLR_GND_ON);

    /* Read board status. */
    pickit2_send (a, 2, CMD_CLEAR_UPLOAD_BUFFER, CMD_READ_STATUS);
    pickit2_recv (a);
    unsigned status = a->reply[0] | a->reply[1] << 8;
    if (debug_level > 0)
        fprintf (stderr, "PICkit2: status %04x\n", status);
    if ((status & ~STATUS_RESET) != (STATUS_VDD_GND_ON | STATUS_VPP_GND_ON)) {
        fprintf (stderr, "PICkit2: invalid status = %04x\n", status);
        goto failed;
    }

    /* Enable power to the board. */
    pickit2_send (a, 4, CMD_EXECUTE_SCRIPT, 2,
        SCRIPT_VDD_GND_OFF,
        SCRIPT_VDD_ON);

    /* Read board status. */
    pickit2_send (a, 2, CMD_CLEAR_UPLOAD_BUFFER, CMD_READ_STATUS);
    pickit2_recv (a);
    status = a->reply[0] | a->reply[1] << 8;
    if (debug_level > 0)
        fprintf (stderr, "PICkit2: status %04x\n", status);
    if (status != (STATUS_VDD_ON | STATUS_VPP_GND_ON)) {
        fprintf (stderr, "PICkit2: invalid status = %04x.\n", status);
        goto failed;
    }

